cases/70lltu12/0.org/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    BA
    {
        //type            fixedFluxPressure;
        type zeroGradient;
    }

    CB
    {
        type            fixedFluxPressure;
    }

    DC
    {
        type            fixedValue;
        value           $internalField;
    }

    AD
    {
        type zeroGradient;
        //type            fixedFluxPressure;
    }
    
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }

}

// ************************************************************************* //
