cases/70lltu12/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1806                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

vertices    //For point description see cases.org
(
    (0.06   0       0.0225) //A -- 0
    (0.06   0      -0.0225) //A'-- 1
    (0.3    0       0.0225) //D -- 2
    (0.3    0      -0.0225) //D'-- 3
    (0.3    0.04    0.0225) //C -- 4
    (0.3    0.04   -0.0225) //C'-- 5
    (0.06   0.01    0.0225) //B -- 6
    (0.06   0.01   -0.0225) //B`-- 7
);

blocks
(
    hex (0 2 3 1 6 4 5 7) (300 1 80) simpleGrading (1 1 200)
    // hex (8 0 1 9 10 6 7 11) (30 1 80) simpleGrading (1 1 200)
);

edges
(
);


boundary
(
    BA
    {
        type patch;
        faces
        (
            (0 6 7 1)
        );
    }

    DC
    {
        type patch;
        faces
        (
            (3 5 4 2)
        );
    }
    CB
    {
        type patch;
        faces
        (   
            (4 5 7 6)
        );
    }
    AD
    {
        type wall;
        faces
        (
            (0 1 3 2)
        );
    }

    front
    {
        type empty;
        faces
        (
            (0 2 4 6)
        );
    }
    
    
    back
    {
        type empty;
        faces
        (
            (1 7 5 3)
        );
    }
    // frontAndBack
    // {
        // type empty;
        // faces
        // (
            // (0 2 4 6)
            // (1 7 5 3)
        // );
    // }
);

mergePatchPairs
(
);

// ************************************************************************* //




