cases/70lltu12/system/sampleH12
libs            ("libsampling.so");
type            sets;
writeControl    writeTime;
interpolationScheme cellPoint;
setFormat       raw;
sets
(
    h12
    {
        type lineUniform;
        axis x;
        start (0.08242 0 0);
        end (0.24224 0 0);
        nPoints 100;
    }
);

fields (H12);
